MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4G7FDFG/mcu.h
/** Processor and Core Peripheral Section */

/* Configuration of the Cortex-M4 Processor and Core Peripherals */
#define __CM4_REV              0x0001       /*!< Cortex-M4 Core Revision                           */
#define __NVIC_PRIO_BITS          4         /*!< Number of Bits used for Priority Levels           */
#define __MPU_PRESENT             1         /*!< MPU present or not                                */
#define __FPU_PRESENT             1         /*!< FPU present or not                                */
#define __Vendor_SysTickConfig    0         /*!< Set to 1 if different SysTick Config is used      */

/** @} */ /* End of group Configuration_of_CMSIS */

#include "core_cm4.h"                       /* Cortex-M4 processor and core peripherals            */
// Note: Changed for MikroE implementation.
// #include "system_TMPM4Gx.h"                 /* TMPM4Gx System                                      */

/** @addtogroup Device_Peripheral_registers
  * @{
  */

/** Device Specific Peripheral registers structures */

/**
  * @brief DMA Controller
  */
typedef struct
{
  __I  uint32_t INTSTATUS;         /*!< DMAC Interrupt Status Register               */
  __I  uint32_t INTTCSTATUS;       /*!< DMAC Interrupt Terminal Count Status Register*/
  __O  uint32_t INTTCCLEAR;        /*!< DMAC Interrupt Terminal Count Clear Register */
  __I  uint32_t INTERRORSTATUS;    /*!< DMAC Interrupt Error Status Register         */
  __O  uint32_t INTERRCLR;         /*!< DMAC Interrupt Error Clear Register          */
  __I  uint32_t RAWINTTCSTATUS;    /*!< DMAC Raw Interrupt Terminal Count Status Register*/
  __I  uint32_t RAWINTERRORSTATUS; /*!< DMAC Raw Error Interrupt Status Register     */
  __I  uint32_t ENBLDCHNS;         /*!< DMAC Enabled Channel Register                */
  __IO uint32_t SOFTBREQ;          /*!< DMAC Software Burst Request Register         */
  __IO uint32_t SOFTSREQ;          /*!< DMAC Software Single Request Register        */
       uint32_t RESERVED0[2];
  __IO uint32_t CONFIGURATION;     /*!< DMAC Configuration Register                  */
       uint32_t RESERVED1[51];
  __IO uint32_t C0SRCADDR;         /*!< DMAC Channel 0 Source Address Register       */
  __IO uint32_t C0DESTADDR;        /*!< DMAC Channel 0 Destination Address Register  */
  __IO uint32_t C0LLI;             /*!< DMAC Channel 0 Linked List Item Register     */
  __IO uint32_t C0CONTROL;         /*!< DMAC Channel 0 Control Register              */
  __IO uint32_t C0CONFIGURATION;   /*!< DMAC Channel 0 Configuration Register        */
       uint32_t RESERVED2[3];
  __IO uint32_t C1SRCADDR;         /*!< DMAC Channel 1 Source Address Register       */
  __IO uint32_t C1DESTADDR;        /*!< DMAC Channel 1 Destination Address Register  */
  __IO uint32_t C1LLI;             /*!< DMAC Channel 1 Linked List Item Register     */
  __IO uint32_t C1CONTROL;         /*!< DMAC Channel 1 Control Register              */
  __IO uint32_t C1CONFIGURATION;   /*!< DMAC Channel 1 Configuration Register        */
} TSB_DMAC_TypeDef;

/**
  * @brief 
  */
typedef struct
{
  __IO uint32_t MAP0;              /*!< SMIF Flash Memory Map0 Register              */
  __IO uint32_t MAP1;              /*!< SMIF Flash Memory Map1 Register              */
  __IO uint32_t DACR0;             /*!< SMIF Direct Access Control Register 0        */
  __IO uint32_t DACR1;             /*!< SMIF Direct Access Control Register 1        */
  __IO uint32_t DRCR0;             /*!< SMIF Direct Read Control Register 0          */
  __IO uint32_t DRCR1;             /*!< SMIF Direct Read Control Register 1          */
       uint32_t RESERVED0[250];
  __IO uint32_t RACR0;             /*!< SMIF Program Register Access Control Register 0*/
  __IO uint32_t RACR1;             /*!< SMIF Program Register Access Control Register 1*/
  __IO uint32_t INT;               /*!< SMIF Program Register Access Interrupt Enable Register*/
  __IO uint32_t STAT;              /*!< SMIF Program Register Access Status Register */
       uint32_t RESERVED1[60];
  __IO uint32_t PBUF0;             /*!< SMIF Program Register Primary Buffer Data Register 0*/
  __IO uint32_t PBUF1;             /*!< SMIF Program Register Primary Buffer Data Register 1*/
       uint32_t RESERVED2[62];
  __IO uint32_t SBUF00;            /*!< SMIF Program Register Secondary Buffer Data Register 00*/
  __IO uint32_t SBUF01;            /*!< SMIF Program Register Secondary Buffer Data Register 01*/
  __IO uint32_t SBUF02;            /*!< SMIF Program Register Secondary Buffer Data Register 02*/
  __IO uint32_t SBUF03;            /*!< SMIF Program Register Secondary Buffer Data Register 03*/
  __IO uint32_t SBUF04;            /*!< SMIF Program Register Secondary Buffer Data Register 04*/
  __IO uint32_t SBUF05;            /*!< SMIF Program Register Secondary Buffer Data Register 05*/
  __IO uint32_t SBUF06;            /*!< SMIF Program Register Secondary Buffer Data Register 06*/
  __IO uint32_t SBUF07;            /*!< SMIF Program Register Secondary Buffer Data Register 07*/
  __IO uint32_t SBUF08;            /*!< SMIF Program Register Secondary Buffer Data Register 08*/
  __IO uint32_t SBUF09;            /*!< SMIF Program Register Secondary Buffer Data Register 09*/
  __IO uint32_t SBUF10;            /*!< SMIF Program Register Secondary Buffer Data Register 10*/
  __IO uint32_t SBUF11;            /*!< SMIF Program Register Secondary Buffer Data Register 11*/
  __IO uint32_t SBUF12;            /*!< SMIF Program Register Secondary Buffer Data Register 12*/
  __IO uint32_t SBUF13;            /*!< SMIF Program Register Secondary Buffer Data Register 13*/
  __IO uint32_t SBUF14;            /*!< SMIF Program Register Secondary Buffer Data Register 14*/
  __IO uint32_t SBUF15;            /*!< SMIF Program Register Secondary Buffer Data Register 15*/
  __IO uint32_t SBUF16;            /*!< SMIF Program Register Secondary Buffer Data Register 16*/
  __IO uint32_t SBUF17;            /*!< SMIF Program Register Secondary Buffer Data Register 17*/
  __IO uint32_t SBUF18;            /*!< SMIF Program Register Secondary Buffer Data Register 18*/
  __IO uint32_t SBUF19;            /*!< SMIF Program Register Secondary Buffer Data Register 19*/
  __IO uint32_t SBUF20;            /*!< SMIF Program Register Secondary Buffer Data Register 20*/
  __IO uint32_t SBUF21;            /*!< SMIF Program Register Secondary Buffer Data Register 21*/
  __IO uint32_t SBUF22;            /*!< SMIF Program Register Secondary Buffer Data Register 22*/
  __IO uint32_t SBUF23;            /*!< SMIF Program Register Secondary Buffer Data Register 23*/
  __IO uint32_t SBUF24;            /*!< SMIF Program Register Secondary Buffer Data Register 24*/
  __IO uint32_t SBUF25;            /*!< SMIF Program Register Secondary Buffer Data Register 25*/
  __IO uint32_t SBUF26;            /*!< SMIF Program Register Secondary Buffer Data Register 26*/
  __IO uint32_t SBUF27;            /*!< SMIF Program Register Secondary Buffer Data Register 27*/
  __IO uint32_t SBUF28;            /*!< SMIF Program Register Secondary Buffer Data Register 28*/
  __IO uint32_t SBUF29;            /*!< SMIF Program Register Secondary Buffer Data Register 29*/
  __IO uint32_t SBUF30;            /*!< SMIF Program Register Secondary Buffer Data Register 30*/
  __IO uint32_t SBUF31;            /*!< SMIF Program Register Secondary Buffer Data Register 31*/
  __IO uint32_t SBUF32;            /*!< SMIF Program Register Secondary Buffer Data Register 32*/
  __IO uint32_t SBUF33;            /*!< SMIF Program Register Secondary Buffer Data Register 33*/
  __IO uint32_t SBUF34;            /*!< SMIF Program Register Secondary Buffer Data Register 34*/
  __IO uint32_t SBUF35;            /*!< SMIF Program Register Secondary Buffer Data Register 35*/
  __IO uint32_t SBUF36;            /*!< SMIF Program Register Secondary Buffer Data Register 36*/
  __IO uint32_t SBUF37;            /*!< SMIF Program Register Secondary Buffer Data Register 37*/
  __IO uint32_t SBUF38;            /*!< SMIF Program Register Secondary Buffer Data Register 38*/
  __IO uint32_t SBUF39;            /*!< SMIF Program Register Secondary Buffer Data Register 39*/
  __IO uint32_t SBUF40;            /*!< SMIF Program Register Secondary Buffer Data Register 40*/
  __IO uint32_t SBUF41;            /*!< SMIF Program Register Secondary Buffer Data Register 41*/
  __IO uint32_t SBUF42;            /*!< SMIF Program Register Secondary Buffer Data Register 42*/
  __IO uint32_t SBUF43;            /*!< SMIF Program Register Secondary Buffer Data Register 43*/
  __IO uint32_t SBUF44;            /*!< SMIF Program Register Secondary Buffer Data Register 44*/
  __IO uint32_t SBUF45;            /*!< SMIF Program Register Secondary Buffer Data Register 45*/
  __IO uint32_t SBUF46;            /*!< SMIF Program Register Secondary Buffer Data Register 46*/
  __IO uint32_t SBUF47;            /*!< SMIF Program Register Secondary Buffer Data Register 47*/
  __IO uint32_t SBUF48;            /*!< SMIF Program Register Secondary Buffer Data Register 48*/
  __IO uint32_t SBUF49;            /*!< SMIF Program Register Secondary Buffer Data Register 49*/
  __IO uint32_t SBUF50;            /*!< SMIF Program Register Secondary Buffer Data Register 50*/
  __IO uint32_t SBUF51;            /*!< SMIF Program Register Secondary Buffer Data Register 51*/
  __IO uint32_t SBUF52;            /*!< SMIF Program Register Secondary Buffer Data Register 52*/
  __IO uint32_t SBUF53;            /*!< SMIF Program Register Secondary Buffer Data Register 53*/
  __IO uint32_t SBUF54;            /*!< SMIF Program Register Secondary Buffer Data Register 54*/
  __IO uint32_t SBUF55;            /*!< SMIF Program Register Secondary Buffer Data Register 55*/
  __IO uint32_t SBUF56;            /*!< SMIF Program Register Secondary Buffer Data Register 56*/
  __IO uint32_t SBUF57;            /*!< SMIF Program Register Secondary Buffer Data Register 57*/
  __IO uint32_t SBUF58;            /*!< SMIF Program Register Secondary Buffer Data Register 58*/
  __IO uint32_t SBUF59;            /*!< SMIF Program Register Secondary Buffer Data Register 59*/
  __IO uint32_t SBUF60;            /*!< SMIF Program Register Secondary Buffer Data Register 60*/
  __IO uint32_t SBUF61;            /*!< SMIF Program Register Secondary Buffer Data Register 61*/
  __IO uint32_t SBUF62;            /*!< SMIF Program Register Secondary Buffer Data Register 62*/
  __IO uint32_t SBUF63;            /*!< SMIF Program Register Secondary Buffer Data Register 63*/
} TSB_SMI_TypeDef;

/**
  * @brief Interrupt control A Register
  */
typedef struct
{
  __IO uint8_t  INC00;             /*!< Non Maskable Interrupu Mode Control Register A 00*/
       uint8_t  RESERVED0[31];
  __IO uint8_t  IMC00;             /*!< Interrupu Mode Control Register A 00         */
  __IO uint8_t  IMC01;             /*!< Interrupu Mode Control Register A 01         */
  __IO uint8_t  IMC02;             /*!< Interrupu Mode Control Register A 02         */
  __IO uint8_t  IMC03;             /*!< Interrupu Mode Control Register A 03         */
  __IO uint8_t  IMC04;             /*!< Interrupu Mode Control Register A 04         */
  __IO uint8_t  IMC05;             /*!< Interrupu Mode Control Register A 05         */
  __IO uint8_t  IMC06;             /*!< Interrupu Mode Control Register A 06         */
  __IO uint8_t  IMC07;             /*!< Interrupu Mode Control Register A 07         */
  __IO uint8_t  IMC08;             /*!< Interrupu Mode Control Register A 08         */
  __IO uint8_t  IMC09;             /*!< Interrupu Mode Control Register A 09         */
  __IO uint8_t  IMC10;             /*!< Interrupu Mode Control Register A 10         */
  __IO uint8_t  IMC11;             /*!< Interrupu Mode Control Register A 11         */
  __IO uint8_t  IMC12;             /*!< Interrupu Mode Control Register A 12         */
  __IO uint8_t  IMC13;             /*!< Interrupu Mode Control Register A 13         */
  __IO uint8_t  IMC14;             /*!< Interrupu Mode Control Register A 14         */
  __IO uint8_t  IMC15;             /*!< Interrupu Mode Control Register A 15         */
  __IO uint8_t  IMC16;             /*!< Interrupu Mode Control Register A 16         */
  __IO uint8_t  IMC17;             /*!< Interrupu Mode Control Register A 17         */
  __IO uint8_t  IMC18;             /*!< Interrupu Mode Control Register A 18         */
  __IO uint8_t  IMC19;             /*!< Interrupu Mode Control Register A 19         */
  __IO uint8_t  IMC20;             /*!< Interrupu Mode Control Register A 20         */
  __IO uint8_t  IMC21;             /*!< Interrupu Mode Control Register A 21         */
  __IO uint8_t  IMC22;             /*!< Interrupu Mode Control Register A 22         */
  __IO uint8_t  IMC23;             /*!< Interrupu Mode Control Register A 23         */
  __IO uint8_t  IMC24;             /*!< Interrupu Mode Control Register A 24         */
  __IO uint8_t  IMC25;             /*!< Interrupu Mode Control Register A 25         */
  __IO uint8_t  IMC26;             /*!< Interrupu Mode Control Register A 26         */
  __IO uint8_t  IMC27;             /*!< Interrupu Mode Control Register A 27         */
  __IO uint8_t  IMC28;             /*!< Interrupu Mode Control Register A 28         */
  __IO uint8_t  IMC29;             /*!< Interrupu Mode Control Register A 29         */
  __IO uint8_t  IMC30;             /*!< Interrupu Mode Control Register A 30         */
  __IO uint8_t  IMC31;             /*!< Interrupu Mode Control Register A 31         */
       uint8_t  RESERVED1[17];
  __IO uint8_t  IMC49;             /*!< Interrupu Mode Control Register A 49         */
  __IO uint8_t  IMC50;             /*!< Interrupu Mode Control Register A 50         */
  __IO uint8_t  IMC51;             /*!< Interrupu Mode Control Register A 51         */
  __IO uint8_t  IMC52;             /*!< Interrupu Mode Control Register A 52         */
  __IO uint8_t  IMC53;             /*!< Interrupu Mode Control Register A 53         */
  __IO uint8_t  IMC54;             /*!< Interrupu Mode Control Register A 54         */
  __IO uint8_t  IMC55;             /*!< Interrupu Mode Control Register A 55         */
  __IO uint8_t  IMC56;             /*!< Interrupu Mode Control Register A 56         */
  __IO uint8_t  IMC57;             /*!< Interrupu Mode Control Register A 57         */
} TSB_IA_TypeDef;

/**
  * @brief Reset Low power Managiment Register
  */
typedef struct
{
  __IO uint8_t  LOSCCR;            /*!< Low OSC and IHOSC2 clock supply Control Register*/
  __IO uint8_t  SHTDNOP;           /*!< Power Shut Down Control Register             */
  __IO uint8_t  RSTFLG0;           /*!< Reset flag register 0                        */
  __IO uint8_t  RSTFLG1;           /*!< Reset flag register 1                        */
       uint8_t  RESERVED0[11];
  __IO uint8_t  PROTECT;           /*!< Protect Register                             */
} TSB_RLM_TypeDef;

/**
  * @brief LVD0
  */
typedef struct
{
  __IO uint8_t  CR1;               /*!< LVD Control register1                        */
  __IO uint8_t  CR2;               /*!< LVD Control register2                        */
  __IO uint8_t  LVL1;              /*!< LVD detection voltage select register 1      */
  __IO uint8_t  LVL2;              /*!< LVD detection voltage select register 2      */
  __I  uint8_t  SR;                /*!< LVD status register                          */
} TSB_LVD_TypeDef;

/**
  * @brief TRGSEL
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TRGSEL Control register 0                    */
  __IO uint32_t CR1;               /*!< TRGSEL Control register 1                    */
  __IO uint32_t CR2;               /*!< TSEL Control register 2                      */
  __IO uint32_t CR3;               /*!< TRGSEL Control register 3                    */
  __IO uint32_t CR4;               /*!< TRGSEL Control register 4                    */
  __IO uint32_t CR5;               /*!< TRGSEL Control register 5                    */
  __IO uint32_t CR6;               /*!< TRGSEL Control register 6                    */
  __IO uint32_t CR7;               /*!< TRGSEL Control register 7                    */
  __IO uint32_t CR8;               /*!< TRGSEL Control register 8                    */
  __IO uint32_t CR9;               /*!< TRGSEL Control register 9                    */
  __IO uint32_t CR10;              /*!< TRGSEL Control register 10                   */
  __IO uint32_t CR11;              /*!< TRGSEL Control register 11                   */
  __IO uint32_t CR12;              /*!< TRGSEL Control register 12                   */
  __IO uint32_t CR13;              /*!< TRGSEL Control register 13                   */
} TSB_TSEL_TypeDef;

/**
  * @brief Long Term Timer(LTTMR)
  */
typedef struct
{
  __IO uint8_t  CR0;               /*!< Long Term Control Register                   */
  __IO uint8_t  VALL;              /*!< Long Term Setting Register                   */
  __IO uint8_t  VALH;              /*!< Long Term Setting Register                   */
} TSB_LTT_TypeDef;

/**
  * @brief Serial Interface (TSPI)
  */
typedef struct
{
  __IO uint32_t CR0;               /*!< TSPI Control Register 0                      */
  __IO uint32_t CR1;               /*!< TSPI Control Register 1                      */
  __IO uint32_t CR2;               /*!< TSPI Control Register 2                      */
  __IO uint32_t CR3;               /*!< TSPI Control Register 3                      */
  __IO uint32_t BR;                /*!< TSPI Baud Rate Generator Control Register    */
  __IO uint32_t FMTR0;             /*!< TSPI Format Control Register 0               */
  __IO uint32_t FMTR1;             /*!< TSPI Format Control Register 1               */
       uint32_t RESERVED0[57];
  __IO uint32_t DR;                /*!< TSPI Data Register                           */
       uint32_t RESERVED1[63];
  __IO uint32_t SR;                /*!< TSPI Status Register                         */
  __IO uint32_t ERR;               /*!< TSPI Parity Error Flag Register              */
} TSB_TSPI_TypeDef;

/**
  * @brief External Bus Interface(EXB)
  */
typedef struct
{
  __IO uint32_t MOD;               /*!< External Bus Mode Control Register           */
       uint32_t RESERVED0[3];
  __IO uint32_t AS0;               /*!< External Bus Base Address and CS Space setting Register 0*/
  __IO uint32_t AS1;               /*!< External Bus Base Address and CS Space setting Register 1 */
  __IO uint32_t AS2;               /*!< External Bus Base Address and CS Space setting Register 2*/
  __IO uint32_t AS3;               /*!< External Bus Base Address and CS Space setting Register 3*/
       uint32_t RESERVED1[8];
  __IO uint32_t CS0;               /*!< Chip Select and Wait Controller Register 0   */
  __IO uint32_t CS1;               /*!< Chip Select and Wait Controller Register 1   */
  __IO uint32_t CS2;               /*!< Chip Select and Wait Controller Register 2   */
  __IO uint32_t CS3;               /*!< Chip Select and Wait Controller Register 3   */
       uint32_t RESERVED2[4];
  __IO uint32_t CLKCTL;            /*!< Clock output controlRegister                 */
} TSB_EXB_TypeDef;

/**
  * @brief Clock Generator (CG)
  */
typedef struct
{
  __IO uint32_t PROTECT;           /*!< Protect Register                             */
  __IO uint32_t OSCCR;             /*!< Oscillation Control Register                 */
  __IO uint32_t SYSCR;             /*!< System Clock Control Register                */
  __IO uint32_t STBYCR;            /*!< Standby Control Register                     */
  __IO uint32_t OCR;               /*!< SCOUT Output Control Register                */
       uint32_t RESERVED0[3];
  __IO uint32_t PLL0SEL;           /*!< PLL Selection Register 0                     */
       uint32_t RESERVED1[3];
  __IO uint32_t WUPHCR;            /*!< High OSC Warming-up Register                 */
  __IO uint32_t WUPLCR;            /*!< Low OSC Warming-up Register                  */
       uint32_t RESERVED2[4];
  __IO uint32_t FSYSMENA;          /*!< Middle fsys Supply Stop Register A           */
  __IO uint32_t FSYSMENB;          /*!< Middle fsys Supply Stop Register A           */
  __IO uint32_t FSYSENA;           /*!< High fsys Supply Stop Register A             */
       uint32_t RESERVED3[2];
  __IO uint32_t SPCLKEN;           /*!< ADC TRACE Clock Supply Stop Register         */
       uint32_t RESERVED4[2];
  __IO uint32_t EXTEND2;           /*!< Extend for MDMAC Register                    */
} TSB_CG_TypeDef;

