MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM4G7FDFG/mcu.h
/* DNF */
#define TSB_DNFA_ENCR_NFEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,0)))
#define TSB_DNFA_ENCR_NFEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,1)))
#define TSB_DNFA_ENCR_NFEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,2)))
#define TSB_DNFA_ENCR_NFEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,3)))
#define TSB_DNFA_ENCR_NFEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,4)))
#define TSB_DNFA_ENCR_NFEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,5)))
#define TSB_DNFA_ENCR_NFEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,6)))
#define TSB_DNFA_ENCR_NFEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,7)))
#define TSB_DNFA_ENCR_NFEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,8)))
#define TSB_DNFA_ENCR_NFEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,9)))
#define TSB_DNFA_ENCR_NFEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,10)))
#define TSB_DNFA_ENCR_NFEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,11)))
#define TSB_DNFA_ENCR_NFEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,12)))
#define TSB_DNFA_ENCR_NFEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,13)))
#define TSB_DNFA_ENCR_NFEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,14)))
#define TSB_DNFA_ENCR_NFEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFA->ENCR,15)))

#define TSB_DNFB_ENCR_NFEN0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,0)))
#define TSB_DNFB_ENCR_NFEN1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,1)))
#define TSB_DNFB_ENCR_NFEN2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,2)))
#define TSB_DNFB_ENCR_NFEN3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,3)))
#define TSB_DNFB_ENCR_NFEN4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,4)))
#define TSB_DNFB_ENCR_NFEN5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,5)))
#define TSB_DNFB_ENCR_NFEN6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,6)))
#define TSB_DNFB_ENCR_NFEN7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,7)))
#define TSB_DNFB_ENCR_NFEN8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,8)))
#define TSB_DNFB_ENCR_NFEN9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,9)))
#define TSB_DNFB_ENCR_NFEN10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,10)))
#define TSB_DNFB_ENCR_NFEN11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,11)))
#define TSB_DNFB_ENCR_NFEN12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,12)))
#define TSB_DNFB_ENCR_NFEN13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,13)))
#define TSB_DNFB_ENCR_NFEN14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,14)))
#define TSB_DNFB_ENCR_NFEN15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_DNFB->ENCR,15)))


/* Watchdog Timer (WD) */
#define TSB_SIWD0_EN_WDTE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->EN,0)))
#define TSB_SIWD0_EN_WDTF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SIWD0->EN,1)))
#define TSB_SIWD0_MOD_RESCR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->MOD,0)))
#define TSB_SIWD0_MOD_INTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->MOD,1)))


/* NBD */
#define TSB_NBD_CR0_NBDEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_NBD->CR0,0)))


/* Malti Porpose Direct Memory Accsess(MDMA) */
#define TSB_MDMA0_XFTYP_UMODE                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->XFTYP,16)))
#define TSB_MDMA0_XFTYP_DMODE                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->XFTYP,24)))
#define TSB_MDMA0_DSNUM_DSINF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->DSNUM,8)))
#define TSB_MDMA0_C00XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C00XFTYP,16)))
#define TSB_MDMA0_C00XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C00XFTYP,24)))
#define TSB_MDMA0_C00DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C00DSNUM,8)))
#define TSB_MDMA0_C01XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C01XFTYP,16)))
#define TSB_MDMA0_C01XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C01XFTYP,24)))
#define TSB_MDMA0_C01DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C01DSNUM,8)))
#define TSB_MDMA0_C02XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C02XFTYP,16)))
#define TSB_MDMA0_C02XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C02XFTYP,24)))
#define TSB_MDMA0_C02DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C02DSNUM,8)))
#define TSB_MDMA0_C03XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C03XFTYP,16)))
#define TSB_MDMA0_C03XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C03XFTYP,24)))
#define TSB_MDMA0_C03DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C03DSNUM,8)))
#define TSB_MDMA0_C04XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C04XFTYP,16)))
#define TSB_MDMA0_C04XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C04XFTYP,24)))
#define TSB_MDMA0_C04DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C04DSNUM,8)))
#define TSB_MDMA0_C05XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C05XFTYP,16)))
#define TSB_MDMA0_C05XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C05XFTYP,24)))
#define TSB_MDMA0_C05DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C05DSNUM,8)))
#define TSB_MDMA0_C06XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C06XFTYP,16)))
#define TSB_MDMA0_C06XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C06XFTYP,24)))
#define TSB_MDMA0_C06DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C06DSNUM,8)))
#define TSB_MDMA0_C07XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C07XFTYP,16)))
#define TSB_MDMA0_C07XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C07XFTYP,24)))
#define TSB_MDMA0_C07DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C07DSNUM,8)))
#define TSB_MDMA0_C08XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C08XFTYP,16)))
#define TSB_MDMA0_C08XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C08XFTYP,24)))
#define TSB_MDMA0_C08DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C08DSNUM,8)))
#define TSB_MDMA0_C09XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C09XFTYP,16)))
#define TSB_MDMA0_C09XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C09XFTYP,24)))
#define TSB_MDMA0_C09DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C09DSNUM,8)))
#define TSB_MDMA0_C10XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C10XFTYP,16)))
#define TSB_MDMA0_C10XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C10XFTYP,24)))
#define TSB_MDMA0_C10DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C10DSNUM,8)))
#define TSB_MDMA0_C11XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C11XFTYP,16)))
#define TSB_MDMA0_C11XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C11XFTYP,24)))
#define TSB_MDMA0_C11DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C11DSNUM,8)))
#define TSB_MDMA0_C12XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C12XFTYP,16)))
#define TSB_MDMA0_C12XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C12XFTYP,24)))
#define TSB_MDMA0_C12DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C12DSNUM,8)))
#define TSB_MDMA0_C13XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C13XFTYP,16)))
#define TSB_MDMA0_C13XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C13XFTYP,24)))
#define TSB_MDMA0_C13DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C13DSNUM,8)))
#define TSB_MDMA0_C14XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C14XFTYP,16)))
#define TSB_MDMA0_C14XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C14XFTYP,24)))
#define TSB_MDMA0_C14DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C14DSNUM,8)))
#define TSB_MDMA0_C15XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C15XFTYP,16)))
#define TSB_MDMA0_C15XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C15XFTYP,24)))
#define TSB_MDMA0_C15DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C15DSNUM,8)))
#define TSB_MDMA0_C16XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C16XFTYP,16)))
#define TSB_MDMA0_C16XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C16XFTYP,24)))
#define TSB_MDMA0_C16DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C16DSNUM,8)))
#define TSB_MDMA0_C17XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C17XFTYP,16)))
#define TSB_MDMA0_C17XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C17XFTYP,24)))
#define TSB_MDMA0_C17DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C17DSNUM,8)))
#define TSB_MDMA0_C18XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C18XFTYP,16)))
#define TSB_MDMA0_C18XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C18XFTYP,24)))
#define TSB_MDMA0_C18DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C18DSNUM,8)))
#define TSB_MDMA0_C19XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C19XFTYP,16)))
#define TSB_MDMA0_C19XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C19XFTYP,24)))
#define TSB_MDMA0_C19DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C19DSNUM,8)))
#define TSB_MDMA0_C20XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C20XFTYP,16)))
#define TSB_MDMA0_C20XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C20XFTYP,24)))
#define TSB_MDMA0_C20DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C20DSNUM,8)))
#define TSB_MDMA0_C21XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C21XFTYP,16)))
#define TSB_MDMA0_C21XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C21XFTYP,24)))
#define TSB_MDMA0_C21DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C21DSNUM,8)))
#define TSB_MDMA0_C22XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C22XFTYP,16)))
#define TSB_MDMA0_C22XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C22XFTYP,24)))
#define TSB_MDMA0_C22DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C22DSNUM,8)))
#define TSB_MDMA0_C23XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C23XFTYP,16)))
#define TSB_MDMA0_C23XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C23XFTYP,24)))
#define TSB_MDMA0_C23DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C23DSNUM,8)))
#define TSB_MDMA0_C24XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C24XFTYP,16)))
#define TSB_MDMA0_C24XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C24XFTYP,24)))
#define TSB_MDMA0_C24DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C24DSNUM,8)))
#define TSB_MDMA0_C25XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C25XFTYP,16)))
#define TSB_MDMA0_C25XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C25XFTYP,24)))
#define TSB_MDMA0_C25DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C25DSNUM,8)))
#define TSB_MDMA0_C26XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C26XFTYP,16)))
#define TSB_MDMA0_C26XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C26XFTYP,24)))
#define TSB_MDMA0_C26DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C26DSNUM,8)))
#define TSB_MDMA0_C27XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C27XFTYP,16)))
#define TSB_MDMA0_C27XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C27XFTYP,24)))
#define TSB_MDMA0_C27DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C27DSNUM,8)))
#define TSB_MDMA0_C28XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C28XFTYP,16)))
#define TSB_MDMA0_C28XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C28XFTYP,24)))
#define TSB_MDMA0_C28DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C28DSNUM,8)))
#define TSB_MDMA0_C29XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C29XFTYP,16)))
#define TSB_MDMA0_C29XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C29XFTYP,24)))
#define TSB_MDMA0_C29DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C29DSNUM,8)))
#define TSB_MDMA0_C30XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C30XFTYP,16)))
#define TSB_MDMA0_C30XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C30XFTYP,24)))
#define TSB_MDMA0_C30DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C30DSNUM,8)))
#define TSB_MDMA0_C31XFTYP_UMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C31XFTYP,16)))
#define TSB_MDMA0_C31XFTYP_DMODE                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C31XFTYP,24)))
#define TSB_MDMA0_C31DSNUM_DSINF                  (*((__I  uint32_t *)BITBAND_PERI(&TSB_MDMA0->C31DSNUM,8)))
#define TSB_MDMA0_MSK_MSK0                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,0)))
#define TSB_MDMA0_MSK_MSK1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,1)))
#define TSB_MDMA0_MSK_MSK2                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,2)))
#define TSB_MDMA0_MSK_MSK3                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,3)))
#define TSB_MDMA0_MSK_MSK4                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,4)))
#define TSB_MDMA0_MSK_MSK5                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,5)))
#define TSB_MDMA0_MSK_MSK6                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,6)))
#define TSB_MDMA0_MSK_MSK7                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,7)))
#define TSB_MDMA0_MSK_MSK8                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,8)))
#define TSB_MDMA0_MSK_MSK9                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,9)))
#define TSB_MDMA0_MSK_MSK10                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,10)))
#define TSB_MDMA0_MSK_MSK11                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,11)))
#define TSB_MDMA0_MSK_MSK12                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,12)))
#define TSB_MDMA0_MSK_MSK13                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,13)))
#define TSB_MDMA0_MSK_MSK14                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,14)))
#define TSB_MDMA0_MSK_MSK15                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,15)))
#define TSB_MDMA0_MSK_MSK16                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,16)))
#define TSB_MDMA0_MSK_MSK17                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,17)))
#define TSB_MDMA0_MSK_MSK18                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,18)))
#define TSB_MDMA0_MSK_MSK19                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,19)))
#define TSB_MDMA0_MSK_MSK20                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,20)))
#define TSB_MDMA0_MSK_MSK21                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,21)))
#define TSB_MDMA0_MSK_MSK22                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,22)))
#define TSB_MDMA0_MSK_MSK23                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,23)))
#define TSB_MDMA0_MSK_MSK24                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,24)))
#define TSB_MDMA0_MSK_MSK25                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,25)))
#define TSB_MDMA0_MSK_MSK26                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,26)))
#define TSB_MDMA0_MSK_MSK27                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,27)))
#define TSB_MDMA0_MSK_MSK28                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,28)))
#define TSB_MDMA0_MSK_MSK29                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,29)))
#define TSB_MDMA0_MSK_MSK30                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,30)))
#define TSB_MDMA0_MSK_MSK31                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_MDMA0->MSK,31)))


